## Plan Result (prod-idp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_application_gateway.idp
  * azurerm_public_ip.idp
  * azurerm_subnet.appgw
* Update
  * module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.idp will be created
  + resource "azurerm_application_gateway" "idp" {
      + id                          = (known after apply)
      + location                    = "uksouth"
      + name                        = "idp-poc-appgw"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "idp-poc-infra-prod"

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "idp-poc-be-address-pool"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + protocol                            = "Http"
          + request_timeout                     = 30
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "idp-poc-fe-config"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = (known after apply)
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "idp-poc-appgw-fe"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "idp-poc-config"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "idp-poc-fe-config"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "idp-poc-appgw-fe"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idp-poc-be-address-pool"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "http-setting"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "listener"
          + id                         = (known after apply)
          + name                       = "request-routing-rule"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + capacity = 2
          + name     = "Standard_v2"
          + tier     = "Standard_v2"
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # azurerm_public_ip.idp will be created
  + resource "azurerm_public_ip" "idp" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "idp-appgw-fe-ip"
      + resource_group_name     = "idp-poc-infra-prod"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
    }

  # azurerm_subnet.appgw will be created
  + resource "azurerm_subnet" "appgw" {
      + address_prefixes                               = [
          + "10.131.1.160/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "appgw"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "idp-poc-infra-prod"
      + virtual_network_name                           = "idp-poc-infra-vnet-prod"
    }

  # module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.KeyVault/vaults/idp-poc-prod|idp-poc-prod"
        name                       = "idp-poc-prod"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so must be replaced
-/+ resource "null_resource" "set-user-permissions" {
      ~ id       = "7468139489826349530" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":11,"Program":"tfcmt","SHA1":"","Target":"prod-idp","Vars":{}} -->